backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]] #2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]] #4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]] #6
  - [-1, 1, Conv, [768, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [768, True]] #8
  - [-1, 1, Conv, [1024, 3, 2]]  # 9-P6/64
  - [-1, 3, C2f, [1024, True]] #10
  - [-1, 1, EnFA, [1024]] #11
  - [-1, 1, SPPF, [1024, 5]]  #12

# YOLOv8.0x6 head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #13
  - [[-1, 8], 1, Concat, [1]]  # cat backbone P5 14
  - [-1, 3, C2, [768, False]]  # 15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #16
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4 17
  - [-1, 3, C2, [512, False]]  # 18

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #19
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3 20
  - [-1, 3, C2, [256, False]]  # 21 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] #22
  - [[-1, 18], 1, Concat, [1]]  # cat head P4 23
  - [-1, 3, C2, [512, False]]  # 24 (P4/16-medium)


  - [-1, 1, Conv, [512, 3, 2]] #25
  - [[-1, 15], 1, Concat, [1]]  # cat head P5 26
  - [-1, 3, C2, [768, False]]  # 27 (P5/32-large)

  - [-1, 1, Conv, [768, 3, 2]] #28
  - [[-1, 12], 1, Concat, [1]]  # cat head P6 29 #29
  - [-1, 1, EnFA, [1024]] #30
  - [-1, 3, C2, [1024, False]]  # 31 (P6/64-xlarge)

  - [[21, 27, 29, 31], 1, Detect, [nc]]  #detect
